tutorials/XiFluid/moriyoshiHomogeneous/moriyoshiHomogeneous/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "combustionPropertiesInclude"

flameWrinkling
{
    model           transport;

    equilibrium
    {
        model           Gulder;
    }

    profile
    {
        model      linear;
    }

    generationRate
    {
        model           KTS;
    }
}


// ************************************************************************* //
